Core/src/Catalogs/ВидыНачисленийИУдержаний/ВидыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНачисленийИУдержаний</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>Взносы в ПФР  с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Взносы в ПФР- накопительная часть(до 2014 года)</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Взносы в ПФР- страховая часть(до 2014 года)</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Взносы в ФСС (временная нетрудоспособность)</description>
    </items>
    <items>
      <name>ФССНесчастныеСлучаи</name>
      <description>Взносы в ФСС (несчастные случаи)</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Взносы в ФФОМС</description>
    </items>
    <items>
      <name>НалогНаДоходы</name>
      <description>Налог на доходы</description>
    </items>
    <items>
      <name>НДФЛКВыплате</name>
      <description>НДФЛ К Выплате</description>
    </items>
    <items>
      <name>НДФЛНачисленный</name>
      <description>НДФЛ Начисленный</description>
    </items>
    <items>
      <name>ПогашениеЗаймаИзЗарплаты</name>
      <description>Погашение займа из зарплаты</description>
    </items>
    <items>
      <name>ПроцентыПоЗайму</name>
      <description>Проценты по займу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата</description>
    </items>
    <items>
      <name>СдельнаяОплатаПроцент</name>
      <description>Сдельная оплата (процент)</description>
    </items>
    <items>
      <name>ФиксированнаяСумма</name>
      <description>Сдельная оплата (фиксированная сумма)</description>
    </items>
    <items>
      <name>ФиксированныйПроцент</name>
      <description>ფიქსირებული პროცენტი</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.КодыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаПоСтраховымВзносам</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаВыплат</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПенсионныйНалогСотрудника</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПенсионныйНалогОрганизации</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Enums/ТипыНачисленийИУдержаний/ТипыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНачисленийИУдержаний</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
  <enumValues>
    <name>Налог</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеПФ</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеДляКонтрагента</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ВидыНачисленийИУдержаний/Forms/ФормаЭлемента/Module.bsl
#Region СлужебныеПроцедурыИФункции

// Процедура устанавливает доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.Тип = Налог Тогда
		
		//Объект.СчетЗатрат = Неопределено;
		
		Элементы.ГруппаФормула.Видимость = Ложь;
		//Объект.Формула = "";
		//Элементы.ГруппаКоды.Видимость = Ложь;
		//Элементы.ВидНалога.Видимость = Истина;
		
	//Паганини ПФ_
		Элементы.ГруппаПФ.Видимость			= Ложь;
		Элементы.ГруппаНДФЛ.Видимость		= Истина;
		Элементы.СчетЗатратРегл.Видимость	= Ложь;
		Элементы.ГруппаУдержание.Видимость	= Ложь;
	ИначеЕсли Объект.Тип = УдержаниеПФ Тогда
		Элементы.ГруппаПФ.Видимость			= Истина;
		Элементы.ГруппаФормула.Видимость	= Ложь;
		Элементы.ГруппаНДФЛ.Видимость		= Ложь;
		Элементы.СчетЗатратРегл.Видимость	= Истина;
		Элементы.ГруппаУдержание.Видимость	= Ложь;
	ИначеЕсли Объект.Тип = УдержаниеДляКонтрагента Тогда
		Элементы.ГруппаПФ.Видимость			= Ложь;
		Элементы.ГруппаФормула.Видимость	= Ложь;
		Элементы.ГруппаНДФЛ.Видимость		= Ложь;
		Элементы.СчетЗатратРегл.Видимость	= Истина;
		Элементы.ГруппаУдержание.Видимость				 = Истина;
		Элементы.ГруппаУдержаниеДляКонтрагента.Видимость = Истина;
		Элементы.ГруппаСтавкиУдержании.Видимость		 = Истина;
	ИначеЕсли Объект.Тип = Удержание Тогда
		Элементы.ГруппаПФ.Видимость			= Ложь;
		Элементы.ГруппаНДФЛ.Видимость		= Ложь;
		Элементы.ГруппаУдержание.Видимость				 = Истина;
		Элементы.ГруппаУдержаниеДляКонтрагента.Видимость = Ложь;
		Элементы.ГруппаСтавкиУдержании.Видимость 		 = Истина;
		Элементы.ГруппаФормула.Видимость 	= Ложь;
	//_Паганини ПФ	
	Иначе
		
		//Элементы.ГруппаКоды.Видимость = НЕ (Объект.Тип = Удержание);
		Элементы.ГруппаФормула.Видимость = Истина;
		
		//Элементы.ВидНалога.Видимость = Ложь;
		//Объект.ВидНалога = Неопределено;
		
		//Паганини ПФ_
		Элементы.ГруппаПФ.Видимость			= Ложь;
		Элементы.ГруппаНДФЛ.Видимость		= Ложь;
		Элементы.СчетЗатратРегл.Видимость	= Истина;
		Элементы.ГруппаУдержание.Видимость 	= Ложь;
		//_Паганини ПФ
	КонецЕсли;
	
	//შეკვეთა განაწესში გადასათვლელი პროცენტი
	Если Объект.Ссылка = Справочники.ВидыНачисленийИУдержаний.ФиксированныйПроцент Тогда
		Элементы.Процент.Видимость = Истина;
		
	Иначе 
		Элементы.Процент.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает значения в зависимости от выбранного типа
//
&НаСервере
Процедура ПриИзмененииТипаВидаНачисленияНаСервере(ТипВидаНачисления)
	//+++ Дмгг
	//Если ТипВидаНачисления = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда
		
		Объект.СчетЗатрат = ПланыСчетов.Управленческий.ПустаяСсылка();
		
	ИначеЕсли ТипВидаНачисления = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
	
		Объект.СчетЗатрат = ПланыСчетов.Управленческий.ПрочиеДоходы;
		
	Иначе
		
		Объект.СчетЗатрат = ПланыСчетов.Управленческий.УправленческиеРасходы;
		
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииТипаВидаНачисленияНаСервере()

#EndRegion

#Region ОбработчикиСобытийФормы

// Процедура обработчик события ПриСозданииНаСервере
// Осуществляет первоначальное заполнение реквизитов формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата());
	Налог = Перечисления.ТипыНачисленийИУдержаний.Налог;
	Удержание = Перечисления.ТипыНачисленийИУдержаний.Удержание;
	//Паганини ПФ_
	УдержаниеПФ = Перечисления.ТипыНачисленийИУдержаний.УдержаниеПФ;
	УдержаниеДляКонтрагента = Перечисления.ТипыНачисленийИУдержаний.УдержаниеДляКонтрагента;
	//_Паганини ПФ
	
	УчетНалогов = ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов");
	Если Не УчетНалогов Тогда
		
		ЭлементСписка = Элементы.Тип.СписокВыбора.НайтиПоЗначению(Перечисления.ТипыНачисленийИУдержаний.Налог);
		Если ЭлементСписка <> Неопределено Тогда
			
			Элементы.Тип.СписокВыбора.Удалить(ЭлементСписка);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	//ЭтоНалог = (Объект.Тип = Налог);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидНалога", "Видимость", ЭтоНалог);
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаФормула", "Видимость", НЕ ЭтоНалог);
	
	ПриИзмененииТипаВидаНачисленияНаСервере(Объект.Тип);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	//ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	//+++ Дмгг
	//Если НЕ ЗначениеЗаполнено(Объект.ВидУдержанияНДФЛ) Тогда 
	//	Элементы.ВидУдержанияНДФЛ.Доступность = Истина;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(Объект.ВидУдержанияПФ) Тогда 
	//	Элементы.ВидУдержанияПФ.Доступность = Истина;
	//КонецЕсли;
	//--- Дмгг
	
	Если Не Объект.Ссылка = Справочники.ВидыНачисленийИУдержаний.ФиксированныйПроцент Тогда 
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура обработчик события ПослеЗаписиНаСервере
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	Если Не Объект.Ссылка = Справочники.ВидыНачисленийИУдержаний.ФиксированныйПроцент Тогда
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Процедура обработчик события ОбработкаОповещения
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьСчетаВидыНачисленийИУдержаний" Тогда
		
		Объект.СчетЗатрат = Параметр.СчетЗатрат;
		Объект.СчетЗатратРегл = Параметр.СчетЗатратРегл;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

#EndRegion

#Region ОбработчикиКомандФормы

// Процедура вызывается при нажатии кнопки "Редактировать формулу расчета". 
//
&НаКлиенте
Процедура КомандаРедактироватьФормулуРасчета(Команда)
	
	СтруктураПараметров = Новый Структура("ТекстФормулы", Объект.Формула);
	Оповещение = Новый ОписаниеОповещения("КомандаРедактироватьФормулуРасчетаЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.ВидыНачисленийИУдержаний.Форма.ФормаРедактированияФормулыРасчета", СтруктураПараметров,,,,,Оповещение);
	
КонецПроцедуры // КомандаРедактироватьФормулуРасчетаВыполнить()

&НаКлиенте
Процедура КомандаРедактироватьФормулуРасчетаЗавершение(ТекстФормулы,Параметры) Экспорт

	Если ТипЗнч(ТекстФормулы) = Тип("Строка") Тогда
		Объект.Формула = ТекстФормулы;
	КонецЕсли;

КонецПроцедуры

#EndRegion

#Region ОбработчикиРеквизитовФормы

// Процедура обработчик события ПриИзменении поля ввода ЮрФизЛицо.
//
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	ПриИзмененииТипаВидаНачисленияНаСервере(Объект.Тип);
	
КонецПроцедуры // ЮрФизЛицоПриИзменении()

#EndRegion

#Region ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если Не ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтаФорма);
	
КонецПроцедуры // Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры


// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#EndRegion
